In [1]:
!pip install -i https://test.pypi.org/simple/ lambdata-karen==0.1.0

Looking in indexes: https://test.pypi.org/simple/
Collecting lambdata-karen==0.1.0
  Downloading https://test-files.pythonhosted.org/packages/55/a4/5ca383ec583ef747eb9969ba85ff0aded7c5c23c4f98540696ee3e9348fe/lambdata_karen-0.1.0-py3-none-any.whl
Installing collected packages: lambdata-karen
Successfully installed lambdata-karen-0.1.0

In [2]:
import statools.tools as st

### Instantiate the object

In [3]:
sales = [3505, 2400, 3027, 2798, 3700, 3250, 2689]
customers = [127, 80, 105, 92, 120, 115, 93]

data = st.DataSet([sales, customers], ['sales', 'customers'])

### Convert into Pandas DataFrame

In [5]:

data.get_dataframe()

   sales  customers
0   3505        127
1   2400         80
2   3027        105
3   2798         92
4   3700        120
5   3250        115
6   2689         93

### Get basic statistics on the data

In [4]:
data.statistics()

                  mean       variance  standard_deviation
sales      3052.714286  214387.904762          463.020415
customers   104.571429     290.952381           17.057326

### Get variance/covariance matrix

In [6]:
data.covariance()

                   sales    customers
sales      214387.904762  7604.357143
customers    7604.357143   290.952381

### Get correlation matrix

In [8]:
data.correlation()

              sales  customers
sales      1.000000   0.962834
customers  0.962834   1.000000

### Test some real world data.

In [9]:
import pandas as pd

In [10]:
df = pd.read_csv('sample_data/california_housing_test.csv')

In [11]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

Extract several columns into Python 'arrays' (raw lists)

In [28]:
median_age = df['housing_median_age'].tolist()
total_bedrooms = df['total_bedrooms'].tolist()
housing_value = df['median_house_value'].tolist()
population = df['population'].tolist()
med_income = df['median_income'].tolist()

Instantiate new instance of statools.tools

In [29]:
real_data = st.DataSet([median_age, total_bedrooms, housing_value, population, med_income],
                       ['median_age', 'total_bedrooms', 'housing_value', 'population', 'median_income'])

COnvert back to Pandas DataFrame

In [32]:
df2 = real_data.get_dataframe()
df2.head()

   median_age  total_bedrooms  housing_value  population  median_income
0        27.0           661.0       344700.0      1537.0         6.6085
1        43.0           310.0       176500.0       809.0         3.5990
2        27.0           507.0       270500.0      1484.0         5.7934
3        28.0            15.0       330000.0        49.0         6.1359
4        19.0           244.0        81700.0       850.0         2.9375

Basic statistics

In [30]:
real_data.statistics()

                         mean      variance  standard_deviation
median_age          28.845333  1.576380e+02           12.555396
total_bedrooms     529.950667  1.727686e+05          415.654368
housing_value   205846.275000  1.279606e+10       113119.687470
population        1402.798667  1.062019e+06         1030.543012
median_income        3.807272  3.439214e+00            1.854512

Compare covariance output with Pandas covariance method

In [31]:
real_data.covariance()

                   median_age  total_bedrooms  ...    population  median_income
median_age         157.637958   -1.686447e+03  ... -3.880217e+03      -3.360256
total_bedrooms   -1686.447113    1.727686e+05  ...  3.668332e+05      18.519657
housing_value   129825.029543    3.868661e+06  ... -1.389295e+05  141119.191538
population       -3880.217212    3.668332e+05  ...  1.062019e+06      61.845972
median_income       -3.360256    1.851966e+01  ...  6.184597e+01       3.439214

[5 rows x 5 columns]

In [33]:
df2.cov()

                   median_age  total_bedrooms  ...    population  median_income
median_age         157.637958   -1.686447e+03  ... -3.880217e+03      -3.360256
total_bedrooms   -1686.447113    1.727686e+05  ...  3.668332e+05      18.519657
housing_value   129825.029543    3.868661e+06  ... -1.389295e+05  141119.191538
population       -3880.217212    3.668332e+05  ...  1.062019e+06      61.845972
median_income       -3.360256    1.851966e+01  ...  6.184597e+01       3.439214

[5 rows x 5 columns]

Compare correlation output with Pandas correlation function

In [34]:
real_data.correlation()

                median_age  total_bedrooms  ...  population  median_income
median_age        1.000000       -0.323154  ...   -0.299888      -0.144315
total_bedrooms   -0.323154        1.000000  ...    0.856387       0.024025
housing_value     0.091409        0.082279  ...   -0.001192       0.672695
population       -0.299888        0.856387  ...    1.000000       0.032361
median_income    -0.144315        0.024025  ...    0.032361       1.000000

[5 rows x 5 columns]

In [35]:
df2.corr()

                median_age  total_bedrooms  ...  population  median_income
median_age        1.000000       -0.323154  ...   -0.299888      -0.144315
total_bedrooms   -0.323154        1.000000  ...    0.856387       0.024025
housing_value     0.091409        0.082279  ...   -0.001192       0.672695
population       -0.299888        0.856387  ...    1.000000       0.032361
median_income    -0.144315        0.024025  ...    0.032361       1.000000

[5 rows x 5 columns]